espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/sensitive_struct.h
/**
 * SPDX-FileCopyrightText: 2021-2022 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Configuration Registers */
/** Type of rom_table_lock register
 *  register description
 */
typedef union {
    struct {
        /** rom_table_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t rom_table_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_rom_table_lock_reg_t;

/** Type of rom_table register
 *  register description
 */
typedef union {
    struct {
        /** rom_table : R/W; bitpos: [31:0]; default: 0;
         *  Need add description
         */
        uint32_t rom_table:32;
    };
    uint32_t val;
} sensitive_rom_table_reg_t;

/** Type of privilege_mode_sel_lock register
 *  register description
 */
typedef union {
    struct {
        /** privilege_mode_sel_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t privilege_mode_sel_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_privilege_mode_sel_lock_reg_t;

/** Type of privilege_mode_sel register
 *  register description
 */
typedef union {
    struct {
        /** privilege_mode_sel : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t privilege_mode_sel:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_privilege_mode_sel_reg_t;

/** Type of apb_peripheral_access_0 register
 *  register description
 */
typedef union {
    struct {
        /** apb_peripheral_access_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t apb_peripheral_access_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_apb_peripheral_access_0_reg_t;

/** Type of apb_peripheral_access_1 register
 *  register description
 */
typedef union {
    struct {
        /** apb_peripheral_access_split_burst : R/W; bitpos: [0]; default: 1;
         *  Need add description
         */
        uint32_t apb_peripheral_access_split_burst:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_apb_peripheral_access_1_reg_t;

/** Type of internal_sram_usage_0 register
 *  register description
 */
typedef union {
    struct {
        /** internal_sram_usage_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t internal_sram_usage_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_internal_sram_usage_0_reg_t;

/** Type of internal_sram_usage_1 register
 *  register description
 */
typedef union {
    struct {
        /** internal_sram_usage_cpu_cache : R/W; bitpos: [0]; default: 1;
         *  Need add description
         */
        uint32_t internal_sram_usage_cpu_cache:1;
        /** internal_sram_usage_cpu_sram : R/W; bitpos: [3:1]; default: 7;
         *  Need add description
         */
        uint32_t internal_sram_usage_cpu_sram:3;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} sensitive_internal_sram_usage_1_reg_t;

/** Type of internal_sram_usage_3 register
 *  register description
 */
typedef union {
    struct {
        /** internal_sram_usage_mac_dump_sram : R/W; bitpos: [2:0]; default: 0;
         *  Need add description
         */
        uint32_t internal_sram_usage_mac_dump_sram:3;
        /** internal_sram_alloc_mac_dump : R/W; bitpos: [3]; default: 0;
         *  Need add description
         */
        uint32_t internal_sram_alloc_mac_dump:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} sensitive_internal_sram_usage_3_reg_t;

/** Type of internal_sram_usage_4 register
 *  register description
 */
typedef union {
    struct {
        /** internal_sram_usage_log_sram : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t internal_sram_usage_log_sram:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_internal_sram_usage_4_reg_t;

/** Type of cache_tag_access_0 register
 *  register description
 */
typedef union {
    struct {
        /** cache_tag_access_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t cache_tag_access_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_cache_tag_access_0_reg_t;

/** Type of cache_tag_access_1 register
 *  register description
 */
typedef union {
    struct {
        /** pro_i_tag_rd_acs : R/W; bitpos: [0]; default: 1;
         *  Need add description
         */
        uint32_t pro_i_tag_rd_acs:1;
        /** pro_i_tag_wr_acs : R/W; bitpos: [1]; default: 1;
         *  Need add description
         */
        uint32_t pro_i_tag_wr_acs:1;
        /** pro_d_tag_rd_acs : R/W; bitpos: [2]; default: 1;
         *  Need add description
         */
        uint32_t pro_d_tag_rd_acs:1;
        /** pro_d_tag_wr_acs : R/W; bitpos: [3]; default: 1;
         *  Need add description
         */
        uint32_t pro_d_tag_wr_acs:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} sensitive_cache_tag_access_1_reg_t;

/** Type of cache_mmu_access_0 register
 *  register description
 */
typedef union {
    struct {
        /** cache_mmu_access_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t cache_mmu_access_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_cache_mmu_access_0_reg_t;

/** Type of cache_mmu_access_1 register
 *  register description
 */
typedef union {
    struct {
        /** pro_mmu_rd_acs : R/W; bitpos: [0]; default: 1;
         *  Need add description
         */
        uint32_t pro_mmu_rd_acs:1;
        /** pro_mmu_wr_acs : R/W; bitpos: [1]; default: 1;
         *  Need add description
         */
        uint32_t pro_mmu_wr_acs:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} sensitive_cache_mmu_access_1_reg_t;

/** Type of dma_apbperi_spi2_pms_constrain_0 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_spi2_pms_constrain_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t dma_apbperi_spi2_pms_constrain_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_dma_apbperi_spi2_pms_constrain_0_reg_t;

/** Type of dma_apbperi_spi2_pms_constrain_1 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_spi2_pms_constrain_sram_world_0_pms_0 : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_spi2_pms_constrain_sram_world_0_pms_0:2;
        /** dma_apbperi_spi2_pms_constrain_sram_world_0_pms_1 : R/W; bitpos: [3:2]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_spi2_pms_constrain_sram_world_0_pms_1:2;
        /** dma_apbperi_spi2_pms_constrain_sram_world_0_pms_2 : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_spi2_pms_constrain_sram_world_0_pms_2:2;
        /** dma_apbperi_spi2_pms_constrain_sram_world_0_pms_3 : R/W; bitpos: [7:6]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_spi2_pms_constrain_sram_world_0_pms_3:2;
        uint32_t reserved_8:4;
        /** dma_apbperi_spi2_pms_constrain_sram_world_1_pms_0 : R/W; bitpos: [13:12]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_spi2_pms_constrain_sram_world_1_pms_0:2;
        /** dma_apbperi_spi2_pms_constrain_sram_world_1_pms_1 : R/W; bitpos: [15:14]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_spi2_pms_constrain_sram_world_1_pms_1:2;
        /** dma_apbperi_spi2_pms_constrain_sram_world_1_pms_2 : R/W; bitpos: [17:16]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_spi2_pms_constrain_sram_world_1_pms_2:2;
        /** dma_apbperi_spi2_pms_constrain_sram_world_1_pms_3 : R/W; bitpos: [19:18]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_spi2_pms_constrain_sram_world_1_pms_3:2;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} sensitive_dma_apbperi_spi2_pms_constrain_1_reg_t;

/** Type of dma_apbperi_uchi0_pms_constrain_0 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_uchi0_pms_constrain_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t dma_apbperi_uchi0_pms_constrain_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_dma_apbperi_uchi0_pms_constrain_0_reg_t;

/** Type of dma_apbperi_uchi0_pms_constrain_1 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_uchi0_pms_constrain_sram_world_0_pms_0 : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_uchi0_pms_constrain_sram_world_0_pms_0:2;
        /** dma_apbperi_uchi0_pms_constrain_sram_world_0_pms_1 : R/W; bitpos: [3:2]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_uchi0_pms_constrain_sram_world_0_pms_1:2;
        /** dma_apbperi_uchi0_pms_constrain_sram_world_0_pms_2 : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_uchi0_pms_constrain_sram_world_0_pms_2:2;
        /** dma_apbperi_uchi0_pms_constrain_sram_world_0_pms_3 : R/W; bitpos: [7:6]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_uchi0_pms_constrain_sram_world_0_pms_3:2;
        uint32_t reserved_8:4;
        /** dma_apbperi_uchi0_pms_constrain_sram_world_1_pms_0 : R/W; bitpos: [13:12]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_uchi0_pms_constrain_sram_world_1_pms_0:2;
        /** dma_apbperi_uchi0_pms_constrain_sram_world_1_pms_1 : R/W; bitpos: [15:14]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_uchi0_pms_constrain_sram_world_1_pms_1:2;
        /** dma_apbperi_uchi0_pms_constrain_sram_world_1_pms_2 : R/W; bitpos: [17:16]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_uchi0_pms_constrain_sram_world_1_pms_2:2;
        /** dma_apbperi_uchi0_pms_constrain_sram_world_1_pms_3 : R/W; bitpos: [19:18]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_uchi0_pms_constrain_sram_world_1_pms_3:2;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} sensitive_dma_apbperi_uchi0_pms_constrain_1_reg_t;

/** Type of dma_apbperi_i2s0_pms_constrain_0 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_i2s0_pms_constrain_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t dma_apbperi_i2s0_pms_constrain_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_dma_apbperi_i2s0_pms_constrain_0_reg_t;

