espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/sensitive_struct.h
/** Type of dma_apbperi_i2s0_pms_constrain_1 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_i2s0_pms_constrain_sram_world_0_pms_0 : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_i2s0_pms_constrain_sram_world_0_pms_0:2;
        /** dma_apbperi_i2s0_pms_constrain_sram_world_0_pms_1 : R/W; bitpos: [3:2]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_i2s0_pms_constrain_sram_world_0_pms_1:2;
        /** dma_apbperi_i2s0_pms_constrain_sram_world_0_pms_2 : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_i2s0_pms_constrain_sram_world_0_pms_2:2;
        /** dma_apbperi_i2s0_pms_constrain_sram_world_0_pms_3 : R/W; bitpos: [7:6]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_i2s0_pms_constrain_sram_world_0_pms_3:2;
        uint32_t reserved_8:4;
        /** dma_apbperi_i2s0_pms_constrain_sram_world_1_pms_0 : R/W; bitpos: [13:12]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_i2s0_pms_constrain_sram_world_1_pms_0:2;
        /** dma_apbperi_i2s0_pms_constrain_sram_world_1_pms_1 : R/W; bitpos: [15:14]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_i2s0_pms_constrain_sram_world_1_pms_1:2;
        /** dma_apbperi_i2s0_pms_constrain_sram_world_1_pms_2 : R/W; bitpos: [17:16]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_i2s0_pms_constrain_sram_world_1_pms_2:2;
        /** dma_apbperi_i2s0_pms_constrain_sram_world_1_pms_3 : R/W; bitpos: [19:18]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_i2s0_pms_constrain_sram_world_1_pms_3:2;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} sensitive_dma_apbperi_i2s0_pms_constrain_1_reg_t;

/** Type of dma_apbperi_mac_pms_constrain_0 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_mac_pms_constrain_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t dma_apbperi_mac_pms_constrain_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_dma_apbperi_mac_pms_constrain_0_reg_t;

/** Type of dma_apbperi_mac_pms_constrain_1 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_mac_pms_constrain_sram_world_0_pms_0 : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_mac_pms_constrain_sram_world_0_pms_0:2;
        /** dma_apbperi_mac_pms_constrain_sram_world_0_pms_1 : R/W; bitpos: [3:2]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_mac_pms_constrain_sram_world_0_pms_1:2;
        /** dma_apbperi_mac_pms_constrain_sram_world_0_pms_2 : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_mac_pms_constrain_sram_world_0_pms_2:2;
        /** dma_apbperi_mac_pms_constrain_sram_world_0_pms_3 : R/W; bitpos: [7:6]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_mac_pms_constrain_sram_world_0_pms_3:2;
        uint32_t reserved_8:4;
        /** dma_apbperi_mac_pms_constrain_sram_world_1_pms_0 : R/W; bitpos: [13:12]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_mac_pms_constrain_sram_world_1_pms_0:2;
        /** dma_apbperi_mac_pms_constrain_sram_world_1_pms_1 : R/W; bitpos: [15:14]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_mac_pms_constrain_sram_world_1_pms_1:2;
        /** dma_apbperi_mac_pms_constrain_sram_world_1_pms_2 : R/W; bitpos: [17:16]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_mac_pms_constrain_sram_world_1_pms_2:2;
        /** dma_apbperi_mac_pms_constrain_sram_world_1_pms_3 : R/W; bitpos: [19:18]; default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_mac_pms_constrain_sram_world_1_pms_3:2;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} sensitive_dma_apbperi_mac_pms_constrain_1_reg_t;

/** Type of dma_apbperi_backup_pms_constrain_0 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_backup_pms_constrain_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t dma_apbperi_backup_pms_constrain_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_dma_apbperi_backup_pms_constrain_0_reg_t;

/** Type of dma_apbperi_backup_pms_constrain_1 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_backup_pms_constrain_sram_world_0_pms_0 : R/W; bitpos: [1:0]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_backup_pms_constrain_sram_world_0_pms_0:2;
        /** dma_apbperi_backup_pms_constrain_sram_world_0_pms_1 : R/W; bitpos: [3:2]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_backup_pms_constrain_sram_world_0_pms_1:2;
        /** dma_apbperi_backup_pms_constrain_sram_world_0_pms_2 : R/W; bitpos: [5:4]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_backup_pms_constrain_sram_world_0_pms_2:2;
        /** dma_apbperi_backup_pms_constrain_sram_world_0_pms_3 : R/W; bitpos: [7:6]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_backup_pms_constrain_sram_world_0_pms_3:2;
        uint32_t reserved_8:4;
        /** dma_apbperi_backup_pms_constrain_sram_world_1_pms_0 : R/W; bitpos: [13:12];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_backup_pms_constrain_sram_world_1_pms_0:2;
        /** dma_apbperi_backup_pms_constrain_sram_world_1_pms_1 : R/W; bitpos: [15:14];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_backup_pms_constrain_sram_world_1_pms_1:2;
        /** dma_apbperi_backup_pms_constrain_sram_world_1_pms_2 : R/W; bitpos: [17:16];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_backup_pms_constrain_sram_world_1_pms_2:2;
        /** dma_apbperi_backup_pms_constrain_sram_world_1_pms_3 : R/W; bitpos: [19:18];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_backup_pms_constrain_sram_world_1_pms_3:2;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} sensitive_dma_apbperi_backup_pms_constrain_1_reg_t;

