espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/sensitive_struct.h
/** Type of dma_apbperi_ble_sec_pms_constrain_1 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_ble_sec_pms_constrain_sram_world_0_pms_0 : R/W; bitpos: [1:0]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_ble_sec_pms_constrain_sram_world_0_pms_0:2;
        /** dma_apbperi_ble_sec_pms_constrain_sram_world_0_pms_1 : R/W; bitpos: [3:2]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_ble_sec_pms_constrain_sram_world_0_pms_1:2;
        /** dma_apbperi_ble_sec_pms_constrain_sram_world_0_pms_2 : R/W; bitpos: [5:4]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_ble_sec_pms_constrain_sram_world_0_pms_2:2;
        /** dma_apbperi_ble_sec_pms_constrain_sram_world_0_pms_3 : R/W; bitpos: [7:6]; default:
         *  3;
         *  Need add description
         */
        uint32_t dma_apbperi_ble_sec_pms_constrain_sram_world_0_pms_3:2;
        uint32_t reserved_8:4;
        /** dma_apbperi_ble_sec_pms_constrain_sram_world_1_pms_0 : R/W; bitpos: [13:12];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_ble_sec_pms_constrain_sram_world_1_pms_0:2;
        /** dma_apbperi_ble_sec_pms_constrain_sram_world_1_pms_1 : R/W; bitpos: [15:14];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_ble_sec_pms_constrain_sram_world_1_pms_1:2;
        /** dma_apbperi_ble_sec_pms_constrain_sram_world_1_pms_2 : R/W; bitpos: [17:16];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_ble_sec_pms_constrain_sram_world_1_pms_2:2;
        /** dma_apbperi_ble_sec_pms_constrain_sram_world_1_pms_3 : R/W; bitpos: [19:18];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_ble_sec_pms_constrain_sram_world_1_pms_3:2;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} sensitive_dma_apbperi_ble_sec_pms_constrain_1_reg_t;

/** Type of dma_apbperi_white_list_pms_constrain_0 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_white_list_pms_constrain_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t dma_apbperi_white_list_pms_constrain_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_dma_apbperi_white_list_pms_constrain_0_reg_t;

/** Type of dma_apbperi_white_list_pms_constrain_1 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_white_list_pms_constrain_sram_world_0_pms_0 : R/W; bitpos: [1:0];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_white_list_pms_constrain_sram_world_0_pms_0:2;
        /** dma_apbperi_white_list_pms_constrain_sram_world_0_pms_1 : R/W; bitpos: [3:2];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_white_list_pms_constrain_sram_world_0_pms_1:2;
        /** dma_apbperi_white_list_pms_constrain_sram_world_0_pms_2 : R/W; bitpos: [5:4];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_white_list_pms_constrain_sram_world_0_pms_2:2;
        /** dma_apbperi_white_list_pms_constrain_sram_world_0_pms_3 : R/W; bitpos: [7:6];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_white_list_pms_constrain_sram_world_0_pms_3:2;
        uint32_t reserved_8:4;
        /** dma_apbperi_white_list_pms_constrain_sram_world_1_pms_0 : R/W; bitpos: [13:12];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_white_list_pms_constrain_sram_world_1_pms_0:2;
        /** dma_apbperi_white_list_pms_constrain_sram_world_1_pms_1 : R/W; bitpos: [15:14];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_white_list_pms_constrain_sram_world_1_pms_1:2;
        /** dma_apbperi_white_list_pms_constrain_sram_world_1_pms_2 : R/W; bitpos: [17:16];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_white_list_pms_constrain_sram_world_1_pms_2:2;
        /** dma_apbperi_white_list_pms_constrain_sram_world_1_pms_3 : R/W; bitpos: [19:18];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_white_list_pms_constrain_sram_world_1_pms_3:2;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} sensitive_dma_apbperi_white_list_pms_constrain_1_reg_t;

/** Type of dma_apbperi_sdio_host_pms_constrain_0 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_sdio_host_pms_constrain_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t dma_apbperi_sdio_host_pms_constrain_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_dma_apbperi_sdio_host_pms_constrain_0_reg_t;

/** Type of dma_apbperi_sdio_host_pms_constrain_1 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_sdio_host_pms_constrain_sram_world_0_pms_0 : R/W; bitpos: [1:0];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_sdio_host_pms_constrain_sram_world_0_pms_0:2;
        /** dma_apbperi_sdio_host_pms_constrain_sram_world_0_pms_1 : R/W; bitpos: [3:2];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_sdio_host_pms_constrain_sram_world_0_pms_1:2;
        /** dma_apbperi_sdio_host_pms_constrain_sram_world_0_pms_2 : R/W; bitpos: [5:4];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_sdio_host_pms_constrain_sram_world_0_pms_2:2;
        /** dma_apbperi_sdio_host_pms_constrain_sram_world_0_pms_3 : R/W; bitpos: [7:6];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_sdio_host_pms_constrain_sram_world_0_pms_3:2;
        uint32_t reserved_8:4;
        /** dma_apbperi_sdio_host_pms_constrain_sram_world_1_pms_0 : R/W; bitpos: [13:12];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_sdio_host_pms_constrain_sram_world_1_pms_0:2;
        /** dma_apbperi_sdio_host_pms_constrain_sram_world_1_pms_1 : R/W; bitpos: [15:14];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_sdio_host_pms_constrain_sram_world_1_pms_1:2;
        /** dma_apbperi_sdio_host_pms_constrain_sram_world_1_pms_2 : R/W; bitpos: [17:16];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_sdio_host_pms_constrain_sram_world_1_pms_2:2;
        /** dma_apbperi_sdio_host_pms_constrain_sram_world_1_pms_3 : R/W; bitpos: [19:18];
         *  default: 3;
         *  Need add description
         */
        uint32_t dma_apbperi_sdio_host_pms_constrain_sram_world_1_pms_3:2;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} sensitive_dma_apbperi_sdio_host_pms_constrain_1_reg_t;

/** Type of dma_apbperi_pms_monitor_0 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_pms_monitor_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t dma_apbperi_pms_monitor_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_dma_apbperi_pms_monitor_0_reg_t;

/** Type of dma_apbperi_pms_monitor_1 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_pms_monitor_violate_clr : R/W; bitpos: [0]; default: 1;
         *  Need add description
         */
        uint32_t dma_apbperi_pms_monitor_violate_clr:1;
        /** dma_apbperi_pms_monitor_violate_en : R/W; bitpos: [1]; default: 1;
         *  Need add description
         */
        uint32_t dma_apbperi_pms_monitor_violate_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} sensitive_dma_apbperi_pms_monitor_1_reg_t;

/** Type of dma_apbperi_pms_monitor_2 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_pms_monitor_violate_intr : RO; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t dma_apbperi_pms_monitor_violate_intr:1;
        /** dma_apbperi_pms_monitor_violate_status_world : RO; bitpos: [2:1]; default: 0;
         *  Need add description
         */
        uint32_t dma_apbperi_pms_monitor_violate_status_world:2;
        /** dma_apbperi_pms_monitor_violate_status_addr : RO; bitpos: [26:3]; default: 0;
         *  Need add description
         */
        uint32_t dma_apbperi_pms_monitor_violate_status_addr:24;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} sensitive_dma_apbperi_pms_monitor_2_reg_t;

