espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/sensitive_struct.h
/** Type of dma_apbperi_pms_monitor_3 register
 *  register description
 */
typedef union {
    struct {
        /** dma_apbperi_pms_monitor_violate_status_wr : RO; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t dma_apbperi_pms_monitor_violate_status_wr:1;
        /** dma_apbperi_pms_monitor_violate_status_byteen : RO; bitpos: [4:1]; default: 0;
         *  Need add description
         */
        uint32_t dma_apbperi_pms_monitor_violate_status_byteen:4;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} sensitive_dma_apbperi_pms_monitor_3_reg_t;

/** Type of core_x_iram0_dram0_dma_split_line_constrain_0 register
 *  register description
 */
typedef union {
    struct {
        /** core_x_iram0_dram0_dma_split_line_constrain_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t core_x_iram0_dram0_dma_split_line_constrain_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_core_x_iram0_dram0_dma_split_line_constrain_0_reg_t;

/** Type of core_x_iram0_dram0_dma_split_line_constrain_1 register
 *  register description
 */
typedef union {
    struct {
        /** core_x_iram0_dram0_dma_sram_category_0 : R/W; bitpos: [1:0]; default: 0;
         *  Need add description
         */
        uint32_t core_x_iram0_dram0_dma_sram_category_0:2;
        /** core_x_iram0_dram0_dma_sram_category_1 : R/W; bitpos: [3:2]; default: 0;
         *  Need add description
         */
        uint32_t core_x_iram0_dram0_dma_sram_category_1:2;
        /** core_x_iram0_dram0_dma_sram_category_2 : R/W; bitpos: [5:4]; default: 0;
         *  Need add description
         */
        uint32_t core_x_iram0_dram0_dma_sram_category_2:2;
        uint32_t reserved_6:8;
        /** core_x_iram0_dram0_dma_sram_splitaddr : R/W; bitpos: [21:14]; default: 0;
         *  Need add description
         */
        uint32_t core_x_iram0_dram0_dma_sram_splitaddr:8;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} sensitive_core_x_iram0_dram0_dma_split_line_constrain_1_reg_t;

/** Type of core_x_iram0_dram0_dma_split_line_constrain_2 register
 *  register description
 */
typedef union {
    struct {
        /** core_x_iram0_sram_line_0_category_0 : R/W; bitpos: [1:0]; default: 0;
         *  Need add description
         */
        uint32_t core_x_iram0_sram_line_0_category_0:2;
        /** core_x_iram0_sram_line_0_category_1 : R/W; bitpos: [3:2]; default: 0;
         *  Need add description
         */
        uint32_t core_x_iram0_sram_line_0_category_1:2;
        /** core_x_iram0_sram_line_0_category_2 : R/W; bitpos: [5:4]; default: 0;
         *  Need add description
         */
        uint32_t core_x_iram0_sram_line_0_category_2:2;
        uint32_t reserved_6:8;
        /** core_x_iram0_sram_line_0_splitaddr : R/W; bitpos: [21:14]; default: 0;
         *  Need add description
         */
        uint32_t core_x_iram0_sram_line_0_splitaddr:8;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} sensitive_core_x_iram0_dram0_dma_split_line_constrain_2_reg_t;

/** Type of core_x_iram0_dram0_dma_split_line_constrain_3 register
 *  register description
 */
typedef union {
    struct {
        /** core_x_iram0_sram_line_1_category_0 : R/W; bitpos: [1:0]; default: 0;
         *  Need add description
         */
        uint32_t core_x_iram0_sram_line_1_category_0:2;
        /** core_x_iram0_sram_line_1_category_1 : R/W; bitpos: [3:2]; default: 0;
         *  Need add description
         */
        uint32_t core_x_iram0_sram_line_1_category_1:2;
        /** core_x_iram0_sram_line_1_category_2 : R/W; bitpos: [5:4]; default: 0;
         *  Need add description
         */
        uint32_t core_x_iram0_sram_line_1_category_2:2;
        uint32_t reserved_6:8;
        /** core_x_iram0_sram_line_1_splitaddr : R/W; bitpos: [21:14]; default: 0;
         *  Need add description
         */
        uint32_t core_x_iram0_sram_line_1_splitaddr:8;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} sensitive_core_x_iram0_dram0_dma_split_line_constrain_3_reg_t;

/** Type of core_x_iram0_dram0_dma_split_line_constrain_4 register
 *  register description
 */
typedef union {
    struct {
        /** core_x_dram0_dma_sram_line_0_category_0 : R/W; bitpos: [1:0]; default: 0;
         *  Need add description
         */
        uint32_t core_x_dram0_dma_sram_line_0_category_0:2;
        /** core_x_dram0_dma_sram_line_0_category_1 : R/W; bitpos: [3:2]; default: 0;
         *  Need add description
         */
        uint32_t core_x_dram0_dma_sram_line_0_category_1:2;
        /** core_x_dram0_dma_sram_line_0_category_2 : R/W; bitpos: [5:4]; default: 0;
         *  Need add description
         */
        uint32_t core_x_dram0_dma_sram_line_0_category_2:2;
        uint32_t reserved_6:8;
        /** core_x_dram0_dma_sram_line_0_splitaddr : R/W; bitpos: [21:14]; default: 0;
         *  Need add description
         */
        uint32_t core_x_dram0_dma_sram_line_0_splitaddr:8;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} sensitive_core_x_iram0_dram0_dma_split_line_constrain_4_reg_t;

/** Type of core_x_iram0_dram0_dma_split_line_constrain_5 register
 *  register description
 */
typedef union {
    struct {
        /** core_x_dram0_dma_sram_line_1_category_0 : R/W; bitpos: [1:0]; default: 0;
         *  Need add description
         */
        uint32_t core_x_dram0_dma_sram_line_1_category_0:2;
        /** core_x_dram0_dma_sram_line_1_category_1 : R/W; bitpos: [3:2]; default: 0;
         *  Need add description
         */
        uint32_t core_x_dram0_dma_sram_line_1_category_1:2;
        /** core_x_dram0_dma_sram_line_1_category_2 : R/W; bitpos: [5:4]; default: 0;
         *  Need add description
         */
        uint32_t core_x_dram0_dma_sram_line_1_category_2:2;
        uint32_t reserved_6:8;
        /** core_x_dram0_dma_sram_line_1_splitaddr : R/W; bitpos: [21:14]; default: 0;
         *  Need add description
         */
        uint32_t core_x_dram0_dma_sram_line_1_splitaddr:8;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} sensitive_core_x_iram0_dram0_dma_split_line_constrain_5_reg_t;

/** Type of core_x_iram0_pms_constrain_0 register
 *  register description
 */
typedef union {
    struct {
        /** core_x_iram0_pms_constrain_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t core_x_iram0_pms_constrain_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_core_x_iram0_pms_constrain_0_reg_t;

/** Type of core_x_iram0_pms_constrain_1 register
 *  register description
 */
typedef union {
    struct {
        /** core_x_iram0_pms_constrain_sram_world_1_pms_0 : R/W; bitpos: [2:0]; default: 7;
         *  Need add description
         */
        uint32_t core_x_iram0_pms_constrain_sram_world_1_pms_0:3;
        /** core_x_iram0_pms_constrain_sram_world_1_pms_1 : R/W; bitpos: [5:3]; default: 7;
         *  Need add description
         */
        uint32_t core_x_iram0_pms_constrain_sram_world_1_pms_1:3;
        /** core_x_iram0_pms_constrain_sram_world_1_pms_2 : R/W; bitpos: [8:6]; default: 7;
         *  Need add description
         */
        uint32_t core_x_iram0_pms_constrain_sram_world_1_pms_2:3;
        /** core_x_iram0_pms_constrain_sram_world_1_pms_3 : R/W; bitpos: [11:9]; default: 7;
         *  Need add description
         */
        uint32_t core_x_iram0_pms_constrain_sram_world_1_pms_3:3;
        /** core_x_iram0_pms_constrain_sram_world_1_cachedataarray_pms_0 : R/W; bitpos:
         *  [14:12]; default: 7;
         *  Need add description
         */
        uint32_t core_x_iram0_pms_constrain_sram_world_1_cachedataarray_pms_0:3;
        uint32_t reserved_15:3;
        /** core_x_iram0_pms_constrain_rom_world_1_pms : R/W; bitpos: [20:18]; default: 7;
         *  Need add description
         */
        uint32_t core_x_iram0_pms_constrain_rom_world_1_pms:3;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} sensitive_core_x_iram0_pms_constrain_1_reg_t;

