espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/sensitive_struct.h
/** Type of core_x_iram0_pms_constrain_2 register
 *  register description
 */
typedef union {
    struct {
        /** core_x_iram0_pms_constrain_sram_world_0_pms_0 : R/W; bitpos: [2:0]; default: 7;
         *  Need add description
         */
        uint32_t core_x_iram0_pms_constrain_sram_world_0_pms_0:3;
        /** core_x_iram0_pms_constrain_sram_world_0_pms_1 : R/W; bitpos: [5:3]; default: 7;
         *  Need add description
         */
        uint32_t core_x_iram0_pms_constrain_sram_world_0_pms_1:3;
        /** core_x_iram0_pms_constrain_sram_world_0_pms_2 : R/W; bitpos: [8:6]; default: 7;
         *  Need add description
         */
        uint32_t core_x_iram0_pms_constrain_sram_world_0_pms_2:3;
        /** core_x_iram0_pms_constrain_sram_world_0_pms_3 : R/W; bitpos: [11:9]; default: 7;
         *  Need add description
         */
        uint32_t core_x_iram0_pms_constrain_sram_world_0_pms_3:3;
        /** core_x_iram0_pms_constrain_sram_world_0_cachedataarray_pms_0 : R/W; bitpos:
         *  [14:12]; default: 7;
         *  Need add description
         */
        uint32_t core_x_iram0_pms_constrain_sram_world_0_cachedataarray_pms_0:3;
        uint32_t reserved_15:3;
        /** core_x_iram0_pms_constrain_rom_world_0_pms : R/W; bitpos: [20:18]; default: 7;
         *  Need add description
         */
        uint32_t core_x_iram0_pms_constrain_rom_world_0_pms:3;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} sensitive_core_x_iram0_pms_constrain_2_reg_t;

/** Type of core_0_iram0_pms_monitor_0 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_iram0_pms_monitor_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t core_0_iram0_pms_monitor_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_core_0_iram0_pms_monitor_0_reg_t;

/** Type of core_0_iram0_pms_monitor_1 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_iram0_pms_monitor_violate_clr : R/W; bitpos: [0]; default: 1;
         *  Need add description
         */
        uint32_t core_0_iram0_pms_monitor_violate_clr:1;
        /** core_0_iram0_pms_monitor_violate_en : R/W; bitpos: [1]; default: 1;
         *  Need add description
         */
        uint32_t core_0_iram0_pms_monitor_violate_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} sensitive_core_0_iram0_pms_monitor_1_reg_t;

/** Type of core_0_iram0_pms_monitor_2 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_iram0_pms_monitor_violate_intr : RO; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t core_0_iram0_pms_monitor_violate_intr:1;
        /** core_0_iram0_pms_monitor_violate_status_wr : RO; bitpos: [1]; default: 0;
         *  Need add description
         */
        uint32_t core_0_iram0_pms_monitor_violate_status_wr:1;
        /** core_0_iram0_pms_monitor_violate_status_loadstore : RO; bitpos: [2]; default: 0;
         *  Need add description
         */
        uint32_t core_0_iram0_pms_monitor_violate_status_loadstore:1;
        /** core_0_iram0_pms_monitor_violate_status_world : RO; bitpos: [4:3]; default: 0;
         *  Need add description
         */
        uint32_t core_0_iram0_pms_monitor_violate_status_world:2;
        /** core_0_iram0_pms_monitor_violate_status_addr : RO; bitpos: [28:5]; default: 0;
         *  Need add description
         */
        uint32_t core_0_iram0_pms_monitor_violate_status_addr:24;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} sensitive_core_0_iram0_pms_monitor_2_reg_t;

/** Type of core_x_dram0_pms_constrain_0 register
 *  register description
 */
typedef union {
    struct {
        /** core_x_dram0_pms_constrain_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t core_x_dram0_pms_constrain_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_core_x_dram0_pms_constrain_0_reg_t;

/** Type of core_x_dram0_pms_constrain_1 register
 *  register description
 */
typedef union {
    struct {
        /** core_x_dram0_pms_constrain_sram_world_0_pms_0 : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t core_x_dram0_pms_constrain_sram_world_0_pms_0:2;
        /** core_x_dram0_pms_constrain_sram_world_0_pms_1 : R/W; bitpos: [3:2]; default: 3;
         *  Need add description
         */
        uint32_t core_x_dram0_pms_constrain_sram_world_0_pms_1:2;
        /** core_x_dram0_pms_constrain_sram_world_0_pms_2 : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t core_x_dram0_pms_constrain_sram_world_0_pms_2:2;
        /** core_x_dram0_pms_constrain_sram_world_0_pms_3 : R/W; bitpos: [7:6]; default: 3;
         *  Need add description
         */
        uint32_t core_x_dram0_pms_constrain_sram_world_0_pms_3:2;
        uint32_t reserved_8:4;
        /** core_x_dram0_pms_constrain_sram_world_1_pms_0 : R/W; bitpos: [13:12]; default: 3;
         *  Need add description
         */
        uint32_t core_x_dram0_pms_constrain_sram_world_1_pms_0:2;
        /** core_x_dram0_pms_constrain_sram_world_1_pms_1 : R/W; bitpos: [15:14]; default: 3;
         *  Need add description
         */
        uint32_t core_x_dram0_pms_constrain_sram_world_1_pms_1:2;
        /** core_x_dram0_pms_constrain_sram_world_1_pms_2 : R/W; bitpos: [17:16]; default: 3;
         *  Need add description
         */
        uint32_t core_x_dram0_pms_constrain_sram_world_1_pms_2:2;
        /** core_x_dram0_pms_constrain_sram_world_1_pms_3 : R/W; bitpos: [19:18]; default: 3;
         *  Need add description
         */
        uint32_t core_x_dram0_pms_constrain_sram_world_1_pms_3:2;
        uint32_t reserved_20:4;
        /** core_x_dram0_pms_constrain_rom_world_0_pms : R/W; bitpos: [25:24]; default: 3;
         *  Need add description
         */
        uint32_t core_x_dram0_pms_constrain_rom_world_0_pms:2;
        /** core_x_dram0_pms_constrain_rom_world_1_pms : R/W; bitpos: [27:26]; default: 3;
         *  Need add description
         */
        uint32_t core_x_dram0_pms_constrain_rom_world_1_pms:2;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} sensitive_core_x_dram0_pms_constrain_1_reg_t;

