espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/sensitive_struct.h
/** Type of core_0_dram0_pms_monitor_0 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_dram0_pms_monitor_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t core_0_dram0_pms_monitor_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_core_0_dram0_pms_monitor_0_reg_t;

/** Type of core_0_dram0_pms_monitor_1 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_dram0_pms_monitor_violate_clr : R/W; bitpos: [0]; default: 1;
         *  Need add description
         */
        uint32_t core_0_dram0_pms_monitor_violate_clr:1;
        /** core_0_dram0_pms_monitor_violate_en : R/W; bitpos: [1]; default: 1;
         *  Need add description
         */
        uint32_t core_0_dram0_pms_monitor_violate_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} sensitive_core_0_dram0_pms_monitor_1_reg_t;

/** Type of core_0_dram0_pms_monitor_2 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_dram0_pms_monitor_violate_intr : RO; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t core_0_dram0_pms_monitor_violate_intr:1;
        /** core_0_dram0_pms_monitor_violate_status_lock : RO; bitpos: [1]; default: 0;
         *  Need add description
         */
        uint32_t core_0_dram0_pms_monitor_violate_status_lock:1;
        /** core_0_dram0_pms_monitor_violate_status_world : RO; bitpos: [3:2]; default: 0;
         *  Need add description
         */
        uint32_t core_0_dram0_pms_monitor_violate_status_world:2;
        /** core_0_dram0_pms_monitor_violate_status_addr : RO; bitpos: [27:4]; default: 0;
         *  Need add description
         */
        uint32_t core_0_dram0_pms_monitor_violate_status_addr:24;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} sensitive_core_0_dram0_pms_monitor_2_reg_t;

/** Type of core_0_dram0_pms_monitor_3 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_dram0_pms_monitor_violate_status_wr : RO; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t core_0_dram0_pms_monitor_violate_status_wr:1;
        /** core_0_dram0_pms_monitor_violate_status_byteen : RO; bitpos: [4:1]; default: 0;
         *  Need add description
         */
        uint32_t core_0_dram0_pms_monitor_violate_status_byteen:4;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} sensitive_core_0_dram0_pms_monitor_3_reg_t;

/** Type of core_0_pif_pms_constrain_0 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_pif_pms_constrain_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_constrain_0_reg_t;

/** Type of core_0_pif_pms_constrain_1 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_pif_pms_constrain_world_0_uart : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_uart:2;
        /** core_0_pif_pms_constrain_world_0_g0spi_1 : R/W; bitpos: [3:2]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_g0spi_1:2;
        /** core_0_pif_pms_constrain_world_0_g0spi_0 : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_g0spi_0:2;
        /** core_0_pif_pms_constrain_world_0_gpio : R/W; bitpos: [7:6]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_gpio:2;
        uint32_t reserved_8:2;
        /** core_0_pif_pms_constrain_world_0_fe : R/W; bitpos: [11:10]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_fe:2;
        uint32_t reserved_12:2;
        /** core_0_pif_pms_constrain_world_0_rtc : R/W; bitpos: [15:14]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_rtc:2;
        /** core_0_pif_pms_constrain_world_0_io_mux : R/W; bitpos: [17:16]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_io_mux:2;
        /** core_0_pif_pms_constrain_world_0_wdg : R/W; bitpos: [19:18]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_wdg:2;
        uint32_t reserved_20:4;
        /** core_0_pif_pms_constrain_world_0_misc : R/W; bitpos: [25:24]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_misc:2;
        /** core_0_pif_pms_constrain_world_0_i2c : R/W; bitpos: [27:26]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_i2c:2;
        uint32_t reserved_28:2;
        /** core_0_pif_pms_constrain_world_0_uart1 : R/W; bitpos: [31:30]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_uart1:2;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_constrain_1_reg_t;

/** Type of core_0_pif_pms_constrain_2 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_pif_pms_constrain_world_0_bt : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_bt:2;
        uint32_t reserved_2:2;
        /** core_0_pif_pms_constrain_world_0_i2c_ext0 : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_i2c_ext0:2;
        /** core_0_pif_pms_constrain_world_0_uhci0 : R/W; bitpos: [7:6]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_uhci0:2;
        uint32_t reserved_8:2;
        /** core_0_pif_pms_constrain_world_0_rmt : R/W; bitpos: [11:10]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_rmt:2;
        uint32_t reserved_12:4;
        /** core_0_pif_pms_constrain_world_0_ledc : R/W; bitpos: [17:16]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_ledc:2;
        /** core_0_pif_pms_constrain_world_0_efuse : R/W; bitpos: [19:18]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_efuse:2;
        uint32_t reserved_20:6;
        /** core_0_pif_pms_constrain_world_0_timergroup : R/W; bitpos: [27:26]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_timergroup:2;
        /** core_0_pif_pms_constrain_world_0_timergroup1 : R/W; bitpos: [29:28]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_timergroup1:2;
        /** core_0_pif_pms_constrain_world_0_systimer : R/W; bitpos: [31:30]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_systimer:2;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_constrain_2_reg_t;

