espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/sensitive_struct.h
/** Type of core_0_pif_pms_constrain_3 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_pif_pms_constrain_world_0_spi_2 : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_spi_2:2;
        uint32_t reserved_2:2;
        /** core_0_pif_pms_constrain_world_0_apb_ctrl : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_apb_ctrl:2;
        uint32_t reserved_6:4;
        /** core_0_pif_pms_constrain_world_0_twai : R/W; bitpos: [11:10]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_twai:2;
        uint32_t reserved_12:2;
        /** core_0_pif_pms_constrain_world_0_i2s1 : R/W; bitpos: [15:14]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_i2s1:2;
        uint32_t reserved_16:6;
        /** core_0_pif_pms_constrain_world_0_rwbt : R/W; bitpos: [23:22]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_rwbt:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_constrain_3_reg_t;

/** Type of core_0_pif_pms_constrain_4 register
 *  register description
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** core_0_pif_pms_constrain_world_0_crypto_peri : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_crypto_peri:2;
        /** core_0_pif_pms_constrain_world_0_crypto_dma : R/W; bitpos: [7:6]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_crypto_dma:2;
        /** core_0_pif_pms_constrain_world_0_apb_adc : R/W; bitpos: [9:8]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_apb_adc:2;
        uint32_t reserved_10:4;
        /** core_0_pif_pms_constrain_world_0_usb_device : R/W; bitpos: [15:14]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_usb_device:2;
        /** core_0_pif_pms_constrain_world_0_etm : R/W; bitpos: [17:16]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_etm:2;
        /** core_0_pif_pms_constrain_world_0_timergroup3 : R/W; bitpos: [19:18]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_timergroup3:2;
        /** core_0_pif_pms_constrain_world_0_ble_sec : R/W; bitpos: [21:20]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_ble_sec:2;
        /** core_0_pif_pms_constrain_world_0_ieee802154mac : R/W; bitpos: [23:22]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_ieee802154mac:2;
        uint32_t reserved_24:2;
        /** core_0_pif_pms_constrain_world_0_coex : R/W; bitpos: [27:26]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_coex:2;
        /** core_0_pif_pms_constrain_world_0_rtc_ble_tmr : R/W; bitpos: [29:28]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_rtc_ble_tmr:2;
        /** core_0_pif_pms_constrain_world_0_clkrst : R/W; bitpos: [31:30]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_clkrst:2;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_constrain_4_reg_t;

/** Type of core_0_pif_pms_constrain_5 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_pif_pms_constrain_world_0_pvt : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_pvt:2;
        /** core_0_pif_pms_constrain_world_0_modem_widgets : R/W; bitpos: [3:2]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_modem_widgets:2;
        /** core_0_pif_pms_constrain_world_0_system : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_system:2;
        /** core_0_pif_pms_constrain_world_0_sensitive : R/W; bitpos: [7:6]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_sensitive:2;
        /** core_0_pif_pms_constrain_world_0_interrupt : R/W; bitpos: [9:8]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_interrupt:2;
        /** core_0_pif_pms_constrain_world_0_dma_copy : R/W; bitpos: [11:10]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_dma_copy:2;
        /** core_0_pif_pms_constrain_world_0_cache_config : R/W; bitpos: [13:12]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_cache_config:2;
        /** core_0_pif_pms_constrain_world_0_ad : R/W; bitpos: [15:14]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_ad:2;
        /** core_0_pif_pms_constrain_world_0_dio : R/W; bitpos: [17:16]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_dio:2;
        /** core_0_pif_pms_constrain_world_0_world_controller : R/W; bitpos: [19:18]; default:
         *  3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_0_world_controller:2;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_constrain_5_reg_t;

/** Type of core_0_pif_pms_constrain_6 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_pif_pms_constrain_world_1_uart : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_uart:2;
        /** core_0_pif_pms_constrain_world_1_g0spi_1 : R/W; bitpos: [3:2]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_g0spi_1:2;
        /** core_0_pif_pms_constrain_world_1_g0spi_0 : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_g0spi_0:2;
        /** core_0_pif_pms_constrain_world_1_gpio : R/W; bitpos: [7:6]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_gpio:2;
        uint32_t reserved_8:2;
        /** core_0_pif_pms_constrain_world_1_fe : R/W; bitpos: [11:10]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_fe:2;
        uint32_t reserved_12:2;
        /** core_0_pif_pms_constrain_world_1_rtc : R/W; bitpos: [15:14]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_rtc:2;
        /** core_0_pif_pms_constrain_world_1_io_mux : R/W; bitpos: [17:16]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_io_mux:2;
        /** core_0_pif_pms_constrain_world_1_wdg : R/W; bitpos: [19:18]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_wdg:2;
        uint32_t reserved_20:4;
        /** core_0_pif_pms_constrain_world_1_misc : R/W; bitpos: [25:24]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_misc:2;
        /** core_0_pif_pms_constrain_world_1_i2c : R/W; bitpos: [27:26]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_i2c:2;
        uint32_t reserved_28:2;
        /** core_0_pif_pms_constrain_world_1_uart1 : R/W; bitpos: [31:30]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_uart1:2;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_constrain_6_reg_t;

/** Type of core_0_pif_pms_constrain_7 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_pif_pms_constrain_world_1_bt : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_bt:2;
        uint32_t reserved_2:2;
        /** core_0_pif_pms_constrain_world_1_i2c_ext0 : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_i2c_ext0:2;
        /** core_0_pif_pms_constrain_world_1_uhci0 : R/W; bitpos: [7:6]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_uhci0:2;
        uint32_t reserved_8:2;
        /** core_0_pif_pms_constrain_world_1_rmt : R/W; bitpos: [11:10]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_rmt:2;
        uint32_t reserved_12:4;
        /** core_0_pif_pms_constrain_world_1_ledc : R/W; bitpos: [17:16]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_ledc:2;
        /** core_0_pif_pms_constrain_world_1_efuse : R/W; bitpos: [19:18]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_efuse:2;
        uint32_t reserved_20:6;
        /** core_0_pif_pms_constrain_world_1_timergroup : R/W; bitpos: [27:26]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_timergroup:2;
        /** core_0_pif_pms_constrain_world_1_timergroup1 : R/W; bitpos: [29:28]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_timergroup1:2;
        /** core_0_pif_pms_constrain_world_1_systimer : R/W; bitpos: [31:30]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_systimer:2;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_constrain_7_reg_t;

/** Type of core_0_pif_pms_constrain_8 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_pif_pms_constrain_world_1_spi_2 : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_spi_2:2;
        uint32_t reserved_2:2;
        /** core_0_pif_pms_constrain_world_1_apb_ctrl : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_apb_ctrl:2;
        uint32_t reserved_6:4;
        /** core_0_pif_pms_constrain_world_1_twai : R/W; bitpos: [11:10]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_twai:2;
        uint32_t reserved_12:2;
        /** core_0_pif_pms_constrain_world_1_i2s1 : R/W; bitpos: [15:14]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_i2s1:2;
        uint32_t reserved_16:6;
        /** core_0_pif_pms_constrain_world_1_rwbt : R/W; bitpos: [23:22]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_rwbt:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_constrain_8_reg_t;

/** Type of core_0_pif_pms_constrain_9 register
 *  register description
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** core_0_pif_pms_constrain_world_1_crypto_peri : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_crypto_peri:2;
        /** core_0_pif_pms_constrain_world_1_crypto_dma : R/W; bitpos: [7:6]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_crypto_dma:2;
        /** core_0_pif_pms_constrain_world_1_apb_adc : R/W; bitpos: [9:8]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_apb_adc:2;
        uint32_t reserved_10:4;
        /** core_0_pif_pms_constrain_world_1_usb_device : R/W; bitpos: [15:14]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_usb_device:2;
        /** core_0_pif_pms_constrain_world_1_etm : R/W; bitpos: [17:16]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_etm:2;
        /** core_0_pif_pms_constrain_world_1_timergroup3 : R/W; bitpos: [19:18]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_timergroup3:2;
        /** core_0_pif_pms_constrain_world_1_ble_sec : R/W; bitpos: [21:20]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_ble_sec:2;
        /** core_0_pif_pms_constrain_world_1_ieee802154mac : R/W; bitpos: [23:22]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_ieee802154mac:2;
        uint32_t reserved_24:2;
        /** core_0_pif_pms_constrain_world_1_coex : R/W; bitpos: [27:26]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_coex:2;
        /** core_0_pif_pms_constrain_world_1_rtc_ble_tmr : R/W; bitpos: [29:28]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_rtc_ble_tmr:2;
        /** core_0_pif_pms_constrain_world_1_clkrst : R/W; bitpos: [31:30]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_clkrst:2;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_constrain_9_reg_t;

/** Type of core_0_pif_pms_constrain_10 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_pif_pms_constrain_world_1_pvt : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_pvt:2;
        /** core_0_pif_pms_constrain_world_1_modem_widgets : R/W; bitpos: [3:2]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_modem_widgets:2;
        /** core_0_pif_pms_constrain_world_1_system : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_system:2;
        /** core_0_pif_pms_constrain_world_1_sensitive : R/W; bitpos: [7:6]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_sensitive:2;
        /** core_0_pif_pms_constrain_world_1_interrupt : R/W; bitpos: [9:8]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_interrupt:2;
        /** core_0_pif_pms_constrain_world_1_dma_copy : R/W; bitpos: [11:10]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_dma_copy:2;
        /** core_0_pif_pms_constrain_world_1_cache_config : R/W; bitpos: [13:12]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_cache_config:2;
        /** core_0_pif_pms_constrain_world_1_ad : R/W; bitpos: [15:14]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_ad:2;
        /** core_0_pif_pms_constrain_world_1_dio : R/W; bitpos: [17:16]; default: 3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_dio:2;
        /** core_0_pif_pms_constrain_world_1_world_controller : R/W; bitpos: [19:18]; default:
         *  3;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_world_1_world_controller:2;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_constrain_10_reg_t;

/** Type of core_0_pif_pms_constrain_11 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_pif_pms_constrain_rtcfast_spltaddr_world_0 : R/W; bitpos: [10:0]; default:
         *  2047;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_rtcfast_spltaddr_world_0:11;
        /** core_0_pif_pms_constrain_rtcfast_spltaddr_world_1 : R/W; bitpos: [21:11]; default:
         *  2047;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_rtcfast_spltaddr_world_1:11;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_constrain_11_reg_t;

/** Type of core_0_pif_pms_constrain_12 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_pif_pms_constrain_rtcfast_world_0_l : R/W; bitpos: [2:0]; default: 7;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_rtcfast_world_0_l:3;
        /** core_0_pif_pms_constrain_rtcfast_world_0_h : R/W; bitpos: [5:3]; default: 7;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_rtcfast_world_0_h:3;
        /** core_0_pif_pms_constrain_rtcfast_world_1_l : R/W; bitpos: [8:6]; default: 7;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_rtcfast_world_1_l:3;
        /** core_0_pif_pms_constrain_rtcfast_world_1_h : R/W; bitpos: [11:9]; default: 7;
         *  Need add description
         */
        uint32_t core_0_pif_pms_constrain_rtcfast_world_1_h:3;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_constrain_12_reg_t;

