espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/sensitive_struct.h
/** Type of region_pms_constrain_0 register
 *  register description
 */
typedef union {
    struct {
        /** region_pms_constrain_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t region_pms_constrain_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_region_pms_constrain_0_reg_t;

/** Type of region_pms_constrain_1 register
 *  register description
 */
typedef union {
    struct {
        /** region_pms_constrain_world_0_area_0 : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t region_pms_constrain_world_0_area_0:2;
        /** region_pms_constrain_world_0_area_1 : R/W; bitpos: [3:2]; default: 3;
         *  Need add description
         */
        uint32_t region_pms_constrain_world_0_area_1:2;
        /** region_pms_constrain_world_0_area_2 : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t region_pms_constrain_world_0_area_2:2;
        /** region_pms_constrain_world_0_area_3 : R/W; bitpos: [7:6]; default: 3;
         *  Need add description
         */
        uint32_t region_pms_constrain_world_0_area_3:2;
        /** region_pms_constrain_world_0_area_4 : R/W; bitpos: [9:8]; default: 3;
         *  Need add description
         */
        uint32_t region_pms_constrain_world_0_area_4:2;
        /** region_pms_constrain_world_0_area_5 : R/W; bitpos: [11:10]; default: 3;
         *  Need add description
         */
        uint32_t region_pms_constrain_world_0_area_5:2;
        /** region_pms_constrain_world_0_area_6 : R/W; bitpos: [13:12]; default: 3;
         *  Need add description
         */
        uint32_t region_pms_constrain_world_0_area_6:2;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} sensitive_region_pms_constrain_1_reg_t;

/** Type of region_pms_constrain_2 register
 *  register description
 */
typedef union {
    struct {
        /** region_pms_constrain_world_1_area_0 : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t region_pms_constrain_world_1_area_0:2;
        /** region_pms_constrain_world_1_area_1 : R/W; bitpos: [3:2]; default: 3;
         *  Need add description
         */
        uint32_t region_pms_constrain_world_1_area_1:2;
        /** region_pms_constrain_world_1_area_2 : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t region_pms_constrain_world_1_area_2:2;
        /** region_pms_constrain_world_1_area_3 : R/W; bitpos: [7:6]; default: 3;
         *  Need add description
         */
        uint32_t region_pms_constrain_world_1_area_3:2;
        /** region_pms_constrain_world_1_area_4 : R/W; bitpos: [9:8]; default: 3;
         *  Need add description
         */
        uint32_t region_pms_constrain_world_1_area_4:2;
        /** region_pms_constrain_world_1_area_5 : R/W; bitpos: [11:10]; default: 3;
         *  Need add description
         */
        uint32_t region_pms_constrain_world_1_area_5:2;
        /** region_pms_constrain_world_1_area_6 : R/W; bitpos: [13:12]; default: 3;
         *  Need add description
         */
        uint32_t region_pms_constrain_world_1_area_6:2;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} sensitive_region_pms_constrain_2_reg_t;

/** Type of region_pms_constrain_3 register
 *  register description
 */
typedef union {
    struct {
        /** region_pms_constrain_addr_0 : R/W; bitpos: [29:0]; default: 0;
         *  Need add description
         */
        uint32_t region_pms_constrain_addr_0:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} sensitive_region_pms_constrain_3_reg_t;

/** Type of region_pms_constrain_4 register
 *  register description
 */
typedef union {
    struct {
        /** region_pms_constrain_addr_1 : R/W; bitpos: [29:0]; default: 0;
         *  Need add description
         */
        uint32_t region_pms_constrain_addr_1:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} sensitive_region_pms_constrain_4_reg_t;

/** Type of region_pms_constrain_5 register
 *  register description
 */
typedef union {
    struct {
        /** region_pms_constrain_addr_2 : R/W; bitpos: [29:0]; default: 0;
         *  Need add description
         */
        uint32_t region_pms_constrain_addr_2:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} sensitive_region_pms_constrain_5_reg_t;

/** Type of region_pms_constrain_6 register
 *  register description
 */
typedef union {
    struct {
        /** region_pms_constrain_addr_3 : R/W; bitpos: [29:0]; default: 0;
         *  Need add description
         */
        uint32_t region_pms_constrain_addr_3:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} sensitive_region_pms_constrain_6_reg_t;

/** Type of region_pms_constrain_7 register
 *  register description
 */
typedef union {
    struct {
        /** region_pms_constrain_addr_4 : R/W; bitpos: [29:0]; default: 0;
         *  Need add description
         */
        uint32_t region_pms_constrain_addr_4:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} sensitive_region_pms_constrain_7_reg_t;

/** Type of region_pms_constrain_8 register
 *  register description
 */
typedef union {
    struct {
        /** region_pms_constrain_addr_5 : R/W; bitpos: [29:0]; default: 0;
         *  Need add description
         */
        uint32_t region_pms_constrain_addr_5:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} sensitive_region_pms_constrain_8_reg_t;

/** Type of region_pms_constrain_9 register
 *  register description
 */
typedef union {
    struct {
        /** region_pms_constrain_addr_6 : R/W; bitpos: [29:0]; default: 0;
         *  Need add description
         */
        uint32_t region_pms_constrain_addr_6:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} sensitive_region_pms_constrain_9_reg_t;

/** Type of region_pms_constrain_10 register
 *  register description
 */
typedef union {
    struct {
        /** region_pms_constrain_addr_7 : R/W; bitpos: [29:0]; default: 0;
         *  Need add description
         */
        uint32_t region_pms_constrain_addr_7:30;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} sensitive_region_pms_constrain_10_reg_t;

