espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/sensitive_struct.h
/** Type of core_0_pif_pms_monitor_0 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_pif_pms_monitor_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t core_0_pif_pms_monitor_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_monitor_0_reg_t;

/** Type of core_0_pif_pms_monitor_1 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_pif_pms_monitor_violate_clr : R/W; bitpos: [0]; default: 1;
         *  Need add description
         */
        uint32_t core_0_pif_pms_monitor_violate_clr:1;
        /** core_0_pif_pms_monitor_violate_en : R/W; bitpos: [1]; default: 1;
         *  Need add description
         */
        uint32_t core_0_pif_pms_monitor_violate_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_monitor_1_reg_t;

/** Type of core_0_pif_pms_monitor_2 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_pif_pms_monitor_violate_intr : RO; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t core_0_pif_pms_monitor_violate_intr:1;
        /** core_0_pif_pms_monitor_violate_status_hport_0 : RO; bitpos: [1]; default: 0;
         *  Need add description
         */
        uint32_t core_0_pif_pms_monitor_violate_status_hport_0:1;
        /** core_0_pif_pms_monitor_violate_status_hsize : RO; bitpos: [4:2]; default: 0;
         *  Need add description
         */
        uint32_t core_0_pif_pms_monitor_violate_status_hsize:3;
        /** core_0_pif_pms_monitor_violate_status_hwrite : RO; bitpos: [5]; default: 0;
         *  Need add description
         */
        uint32_t core_0_pif_pms_monitor_violate_status_hwrite:1;
        /** core_0_pif_pms_monitor_violate_status_hworld : RO; bitpos: [7:6]; default: 0;
         *  Need add description
         */
        uint32_t core_0_pif_pms_monitor_violate_status_hworld:2;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_monitor_2_reg_t;

/** Type of core_0_pif_pms_monitor_3 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_pif_pms_monitor_violate_status_haddr : RO; bitpos: [31:0]; default: 0;
         *  Need add description
         */
        uint32_t core_0_pif_pms_monitor_violate_status_haddr:32;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_monitor_3_reg_t;

/** Type of core_0_pif_pms_monitor_4 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_pif_pms_monitor_nonword_violate_clr : R/W; bitpos: [0]; default: 1;
         *  Need add description
         */
        uint32_t core_0_pif_pms_monitor_nonword_violate_clr:1;
        /** core_0_pif_pms_monitor_nonword_violate_en : R/W; bitpos: [1]; default: 1;
         *  Need add description
         */
        uint32_t core_0_pif_pms_monitor_nonword_violate_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_monitor_4_reg_t;

/** Type of core_0_pif_pms_monitor_5 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_pif_pms_monitor_nonword_violate_intr : RO; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t core_0_pif_pms_monitor_nonword_violate_intr:1;
        /** core_0_pif_pms_monitor_nonword_violate_status_hsize : RO; bitpos: [2:1]; default: 0;
         *  Need add description
         */
        uint32_t core_0_pif_pms_monitor_nonword_violate_status_hsize:2;
        /** core_0_pif_pms_monitor_nonword_violate_status_hworld : RO; bitpos: [4:3]; default:
         *  0;
         *  Need add description
         */
        uint32_t core_0_pif_pms_monitor_nonword_violate_status_hworld:2;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_monitor_5_reg_t;

/** Type of core_0_pif_pms_monitor_6 register
 *  register description
 */
typedef union {
    struct {
        /** core_0_pif_pms_monitor_nonword_violate_status_haddr : RO; bitpos: [31:0]; default:
         *  0;
         *  Need add description
         */
        uint32_t core_0_pif_pms_monitor_nonword_violate_status_haddr:32;
    };
    uint32_t val;
} sensitive_core_0_pif_pms_monitor_6_reg_t;

/** Type of backup_bus_pms_constrain_0 register
 *  register description
 */
typedef union {
    struct {
        /** backup_bus_pms_constrain_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_backup_bus_pms_constrain_0_reg_t;

/** Type of backup_bus_pms_constrain_1 register
 *  register description
 */
typedef union {
    struct {
        /** backup_bus_pms_constrain_uart : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_uart:2;
        /** backup_bus_pms_constrain_g0spi_1 : R/W; bitpos: [3:2]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_g0spi_1:2;
        /** backup_bus_pms_constrain_g0spi_0 : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_g0spi_0:2;
        /** backup_bus_pms_constrain_gpio : R/W; bitpos: [7:6]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_gpio:2;
        uint32_t reserved_8:2;
        /** backup_bus_pms_constrain_fe : R/W; bitpos: [11:10]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_fe:2;
        uint32_t reserved_12:2;
        /** backup_bus_pms_constrain_rtc : R/W; bitpos: [15:14]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_rtc:2;
        /** backup_bus_pms_constrain_io_mux : R/W; bitpos: [17:16]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_io_mux:2;
        /** backup_bus_pms_constrain_wdg : R/W; bitpos: [19:18]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_wdg:2;
        uint32_t reserved_20:4;
        /** backup_bus_pms_constrain_misc : R/W; bitpos: [25:24]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_misc:2;
        /** backup_bus_pms_constrain_i2c : R/W; bitpos: [27:26]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_i2c:2;
        uint32_t reserved_28:2;
        /** backup_bus_pms_constrain_uart1 : R/W; bitpos: [31:30]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_uart1:2;
    };
    uint32_t val;
} sensitive_backup_bus_pms_constrain_1_reg_t;

/** Type of backup_bus_pms_constrain_2 register
 *  register description
 */
typedef union {
    struct {
        /** backup_bus_pms_constrain_bt : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_bt:2;
        uint32_t reserved_2:2;
        /** backup_bus_pms_constrain_i2c_ext0 : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_i2c_ext0:2;
        /** backup_bus_pms_constrain_uhci0 : R/W; bitpos: [7:6]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_uhci0:2;
        uint32_t reserved_8:2;
        /** backup_bus_pms_constrain_rmt : R/W; bitpos: [11:10]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_rmt:2;
        uint32_t reserved_12:4;
        /** backup_bus_pms_constrain_ledc : R/W; bitpos: [17:16]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_ledc:2;
        /** backup_bus_pms_constrain_efuse : R/W; bitpos: [19:18]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_efuse:2;
        uint32_t reserved_20:6;
        /** backup_bus_pms_constrain_timergroup : R/W; bitpos: [27:26]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_timergroup:2;
        /** backup_bus_pms_constrain_timergroup1 : R/W; bitpos: [29:28]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_timergroup1:2;
        /** backup_bus_pms_constrain_systimer : R/W; bitpos: [31:30]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_systimer:2;
    };
    uint32_t val;
} sensitive_backup_bus_pms_constrain_2_reg_t;

