espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/sensitive_struct.h
/** Type of backup_bus_pms_constrain_3 register
 *  register description
 */
typedef union {
    struct {
        /** backup_bus_pms_constrain_spi_2 : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_spi_2:2;
        uint32_t reserved_2:2;
        /** backup_bus_pms_constrain_apb_ctrl : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_apb_ctrl:2;
        uint32_t reserved_6:4;
        /** backup_bus_pms_constrain_twai : R/W; bitpos: [11:10]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_twai:2;
        uint32_t reserved_12:2;
        /** backup_bus_pms_constrain_i2s1 : R/W; bitpos: [15:14]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_i2s1:2;
        uint32_t reserved_16:6;
        /** backup_bus_pms_constrain_rwbt : R/W; bitpos: [23:22]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_rwbt:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} sensitive_backup_bus_pms_constrain_3_reg_t;

/** Type of backup_bus_pms_constrain_4 register
 *  register description
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** backup_bus_pms_constrain_crypto_peri : R/W; bitpos: [5:4]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_crypto_peri:2;
        /** backup_bus_pms_constrain_crypto_dma : R/W; bitpos: [7:6]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_crypto_dma:2;
        /** backup_bus_pms_constrain_apb_adc : R/W; bitpos: [9:8]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_apb_adc:2;
        uint32_t reserved_10:4;
        /** backup_bus_pms_constrain_usb_device : R/W; bitpos: [15:14]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_usb_device:2;
        /** backup_bus_pms_constrain_etm : R/W; bitpos: [17:16]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_etm:2;
        /** backup_bus_pms_constrain_timergroup3 : R/W; bitpos: [19:18]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_timergroup3:2;
        /** backup_bus_pms_constrain_ble_sec : R/W; bitpos: [21:20]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_ble_sec:2;
        /** backup_bus_pms_constrain_ieee802154mac : R/W; bitpos: [23:22]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_ieee802154mac:2;
        uint32_t reserved_24:2;
        /** backup_bus_pms_constrain_coex : R/W; bitpos: [27:26]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_coex:2;
        /** backup_bus_pms_constrain_rtc_ble_tmr : R/W; bitpos: [29:28]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_rtc_ble_tmr:2;
        /** backup_bus_pms_constrain_clkrst : R/W; bitpos: [31:30]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_clkrst:2;
    };
    uint32_t val;
} sensitive_backup_bus_pms_constrain_4_reg_t;

/** Type of backup_bus_pms_constrain_5 register
 *  register description
 */
typedef union {
    struct {
        /** backup_bus_pms_constrain_pvt : R/W; bitpos: [1:0]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_pvt:2;
        /** backup_bus_pms_constrain_modem_widgets : R/W; bitpos: [3:2]; default: 3;
         *  Need add description
         */
        uint32_t backup_bus_pms_constrain_modem_widgets:2;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} sensitive_backup_bus_pms_constrain_5_reg_t;

/** Type of backup_bus_pms_monitor_0 register
 *  register description
 */
typedef union {
    struct {
        /** backup_bus_pms_monitor_lock : R/W; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t backup_bus_pms_monitor_lock:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_backup_bus_pms_monitor_0_reg_t;

/** Type of backup_bus_pms_monitor_1 register
 *  register description
 */
typedef union {
    struct {
        /** backup_bus_pms_monitor_violate_clr : R/W; bitpos: [0]; default: 1;
         *  Need add description
         */
        uint32_t backup_bus_pms_monitor_violate_clr:1;
        /** backup_bus_pms_monitor_violate_en : R/W; bitpos: [1]; default: 1;
         *  Need add description
         */
        uint32_t backup_bus_pms_monitor_violate_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} sensitive_backup_bus_pms_monitor_1_reg_t;

/** Type of backup_bus_pms_monitor_2 register
 *  register description
 */
typedef union {
    struct {
        /** backup_bus_pms_monitor_violate_intr : RO; bitpos: [0]; default: 0;
         *  Need add description
         */
        uint32_t backup_bus_pms_monitor_violate_intr:1;
        /** backup_bus_pms_monitor_violate_status_htrans : RO; bitpos: [2:1]; default: 0;
         *  Need add description
         */
        uint32_t backup_bus_pms_monitor_violate_status_htrans:2;
        /** backup_bus_pms_monitor_violate_status_hsize : RO; bitpos: [5:3]; default: 0;
         *  Need add description
         */
        uint32_t backup_bus_pms_monitor_violate_status_hsize:3;
        /** backup_bus_pms_monitor_violate_status_hwrite : RO; bitpos: [6]; default: 0;
         *  Need add description
         */
        uint32_t backup_bus_pms_monitor_violate_status_hwrite:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} sensitive_backup_bus_pms_monitor_2_reg_t;

/** Type of backup_bus_pms_monitor_3 register
 *  register description
 */
typedef union {
    struct {
        /** backup_bus_pms_monitor_violate_haddr : RO; bitpos: [31:0]; default: 0;
         *  Need add description
         */
        uint32_t backup_bus_pms_monitor_violate_haddr:32;
    };
    uint32_t val;
} sensitive_backup_bus_pms_monitor_3_reg_t;

/** Type of clock_gate register
 *  register description
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 1;
         *  Need add description
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} sensitive_clock_gate_reg_t;

