espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/sensitive_struct.h
/** Type of sensitive_reg_date register
 *  register description
 */
typedef union {
    struct {
        /** sensitive_reg_date : R/W; bitpos: [27:0]; default: 34636368;
         *  Need add description
         */
        uint32_t sensitive_reg_date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} sensitive_sensitive_reg_date_reg_t;


typedef struct {
    volatile sensitive_rom_table_lock_reg_t rom_table_lock;
    volatile sensitive_rom_table_reg_t rom_table;
    volatile sensitive_privilege_mode_sel_lock_reg_t privilege_mode_sel_lock;
    volatile sensitive_privilege_mode_sel_reg_t privilege_mode_sel;
    volatile sensitive_apb_peripheral_access_0_reg_t apb_peripheral_access_0;
    volatile sensitive_apb_peripheral_access_1_reg_t apb_peripheral_access_1;
    volatile sensitive_internal_sram_usage_0_reg_t internal_sram_usage_0;
    volatile sensitive_internal_sram_usage_1_reg_t internal_sram_usage_1;
    volatile sensitive_internal_sram_usage_3_reg_t internal_sram_usage_3;
    volatile sensitive_internal_sram_usage_4_reg_t internal_sram_usage_4;
    volatile sensitive_cache_tag_access_0_reg_t cache_tag_access_0;
    volatile sensitive_cache_tag_access_1_reg_t cache_tag_access_1;
    volatile sensitive_cache_mmu_access_0_reg_t cache_mmu_access_0;
    volatile sensitive_cache_mmu_access_1_reg_t cache_mmu_access_1;
    volatile sensitive_dma_apbperi_spi2_pms_constrain_0_reg_t dma_apbperi_spi2_pms_constrain_0;
    volatile sensitive_dma_apbperi_spi2_pms_constrain_1_reg_t dma_apbperi_spi2_pms_constrain_1;
    volatile sensitive_dma_apbperi_uchi0_pms_constrain_0_reg_t dma_apbperi_uchi0_pms_constrain_0;
    volatile sensitive_dma_apbperi_uchi0_pms_constrain_1_reg_t dma_apbperi_uchi0_pms_constrain_1;
    volatile sensitive_dma_apbperi_i2s0_pms_constrain_0_reg_t dma_apbperi_i2s0_pms_constrain_0;
    volatile sensitive_dma_apbperi_i2s0_pms_constrain_1_reg_t dma_apbperi_i2s0_pms_constrain_1;
    volatile sensitive_dma_apbperi_mac_pms_constrain_0_reg_t dma_apbperi_mac_pms_constrain_0;
    volatile sensitive_dma_apbperi_mac_pms_constrain_1_reg_t dma_apbperi_mac_pms_constrain_1;
    volatile sensitive_dma_apbperi_backup_pms_constrain_0_reg_t dma_apbperi_backup_pms_constrain_0;
    volatile sensitive_dma_apbperi_backup_pms_constrain_1_reg_t dma_apbperi_backup_pms_constrain_1;
    volatile sensitive_dma_apbperi_lc_pms_constrain_0_reg_t dma_apbperi_lc_pms_constrain_0;
    volatile sensitive_dma_apbperi_lc_pms_constrain_1_reg_t dma_apbperi_lc_pms_constrain_1;
    volatile sensitive_dma_apbperi_aes_pms_constrain_0_reg_t dma_apbperi_aes_pms_constrain_0;
    volatile sensitive_dma_apbperi_aes_pms_constrain_1_reg_t dma_apbperi_aes_pms_constrain_1;
    volatile sensitive_dma_apbperi_sha_pms_constrain_0_reg_t dma_apbperi_sha_pms_constrain_0;
    volatile sensitive_dma_apbperi_sha_pms_constrain_1_reg_t dma_apbperi_sha_pms_constrain_1;
    volatile sensitive_dma_apbperi_adc_dac_pms_constrain_0_reg_t dma_apbperi_adc_dac_pms_constrain_0;
    volatile sensitive_dma_apbperi_adc_dac_pms_constrain_1_reg_t dma_apbperi_adc_dac_pms_constrain_1;
    volatile sensitive_dma_apbperi_ble_sec_pms_constrain_0_reg_t dma_apbperi_ble_sec_pms_constrain_0;
    volatile sensitive_dma_apbperi_ble_sec_pms_constrain_1_reg_t dma_apbperi_ble_sec_pms_constrain_1;
    volatile sensitive_dma_apbperi_white_list_pms_constrain_0_reg_t dma_apbperi_white_list_pms_constrain_0;
    volatile sensitive_dma_apbperi_white_list_pms_constrain_1_reg_t dma_apbperi_white_list_pms_constrain_1;
    volatile sensitive_dma_apbperi_sdio_host_pms_constrain_0_reg_t dma_apbperi_sdio_host_pms_constrain_0;
    volatile sensitive_dma_apbperi_sdio_host_pms_constrain_1_reg_t dma_apbperi_sdio_host_pms_constrain_1;
    volatile sensitive_dma_apbperi_pms_monitor_0_reg_t dma_apbperi_pms_monitor_0;
    volatile sensitive_dma_apbperi_pms_monitor_1_reg_t dma_apbperi_pms_monitor_1;
    volatile sensitive_dma_apbperi_pms_monitor_2_reg_t dma_apbperi_pms_monitor_2;
    volatile sensitive_dma_apbperi_pms_monitor_3_reg_t dma_apbperi_pms_monitor_3;
    volatile sensitive_core_x_iram0_dram0_dma_split_line_constrain_0_reg_t core_x_iram0_dram0_dma_split_line_constrain_0;
    volatile sensitive_core_x_iram0_dram0_dma_split_line_constrain_1_reg_t core_x_iram0_dram0_dma_split_line_constrain_1;
    volatile sensitive_core_x_iram0_dram0_dma_split_line_constrain_2_reg_t core_x_iram0_dram0_dma_split_line_constrain_2;
    volatile sensitive_core_x_iram0_dram0_dma_split_line_constrain_3_reg_t core_x_iram0_dram0_dma_split_line_constrain_3;
    volatile sensitive_core_x_iram0_dram0_dma_split_line_constrain_4_reg_t core_x_iram0_dram0_dma_split_line_constrain_4;
    volatile sensitive_core_x_iram0_dram0_dma_split_line_constrain_5_reg_t core_x_iram0_dram0_dma_split_line_constrain_5;
    volatile sensitive_core_x_iram0_pms_constrain_0_reg_t core_x_iram0_pms_constrain_0;
    volatile sensitive_core_x_iram0_pms_constrain_1_reg_t core_x_iram0_pms_constrain_1;
    volatile sensitive_core_x_iram0_pms_constrain_2_reg_t core_x_iram0_pms_constrain_2;
    volatile sensitive_core_0_iram0_pms_monitor_0_reg_t core_0_iram0_pms_monitor_0;
    volatile sensitive_core_0_iram0_pms_monitor_1_reg_t core_0_iram0_pms_monitor_1;
    volatile sensitive_core_0_iram0_pms_monitor_2_reg_t core_0_iram0_pms_monitor_2;
    volatile sensitive_core_x_dram0_pms_constrain_0_reg_t core_x_dram0_pms_constrain_0;
    volatile sensitive_core_x_dram0_pms_constrain_1_reg_t core_x_dram0_pms_constrain_1;
    volatile sensitive_core_0_dram0_pms_monitor_0_reg_t core_0_dram0_pms_monitor_0;
    volatile sensitive_core_0_dram0_pms_monitor_1_reg_t core_0_dram0_pms_monitor_1;
    volatile sensitive_core_0_dram0_pms_monitor_2_reg_t core_0_dram0_pms_monitor_2;
    volatile sensitive_core_0_dram0_pms_monitor_3_reg_t core_0_dram0_pms_monitor_3;
    volatile sensitive_core_0_pif_pms_constrain_0_reg_t core_0_pif_pms_constrain_0;
    volatile sensitive_core_0_pif_pms_constrain_1_reg_t core_0_pif_pms_constrain_1;
    volatile sensitive_core_0_pif_pms_constrain_2_reg_t core_0_pif_pms_constrain_2;
    volatile sensitive_core_0_pif_pms_constrain_3_reg_t core_0_pif_pms_constrain_3;
    volatile sensitive_core_0_pif_pms_constrain_4_reg_t core_0_pif_pms_constrain_4;
    volatile sensitive_core_0_pif_pms_constrain_5_reg_t core_0_pif_pms_constrain_5;
    volatile sensitive_core_0_pif_pms_constrain_6_reg_t core_0_pif_pms_constrain_6;
    volatile sensitive_core_0_pif_pms_constrain_7_reg_t core_0_pif_pms_constrain_7;
    volatile sensitive_core_0_pif_pms_constrain_8_reg_t core_0_pif_pms_constrain_8;
    volatile sensitive_core_0_pif_pms_constrain_9_reg_t core_0_pif_pms_constrain_9;
    volatile sensitive_core_0_pif_pms_constrain_10_reg_t core_0_pif_pms_constrain_10;
    volatile sensitive_core_0_pif_pms_constrain_11_reg_t core_0_pif_pms_constrain_11;
    volatile sensitive_core_0_pif_pms_constrain_12_reg_t core_0_pif_pms_constrain_12;
    volatile sensitive_region_pms_constrain_0_reg_t region_pms_constrain_0;
    volatile sensitive_region_pms_constrain_1_reg_t region_pms_constrain_1;
    volatile sensitive_region_pms_constrain_2_reg_t region_pms_constrain_2;
    volatile sensitive_region_pms_constrain_3_reg_t region_pms_constrain_3;
    volatile sensitive_region_pms_constrain_4_reg_t region_pms_constrain_4;
    volatile sensitive_region_pms_constrain_5_reg_t region_pms_constrain_5;
    volatile sensitive_region_pms_constrain_6_reg_t region_pms_constrain_6;
    volatile sensitive_region_pms_constrain_7_reg_t region_pms_constrain_7;
    volatile sensitive_region_pms_constrain_8_reg_t region_pms_constrain_8;
    volatile sensitive_region_pms_constrain_9_reg_t region_pms_constrain_9;
    volatile sensitive_region_pms_constrain_10_reg_t region_pms_constrain_10;
    volatile sensitive_core_0_pif_pms_monitor_0_reg_t core_0_pif_pms_monitor_0;
    volatile sensitive_core_0_pif_pms_monitor_1_reg_t core_0_pif_pms_monitor_1;
    volatile sensitive_core_0_pif_pms_monitor_2_reg_t core_0_pif_pms_monitor_2;
    volatile sensitive_core_0_pif_pms_monitor_3_reg_t core_0_pif_pms_monitor_3;
    volatile sensitive_core_0_pif_pms_monitor_4_reg_t core_0_pif_pms_monitor_4;
    volatile sensitive_core_0_pif_pms_monitor_5_reg_t core_0_pif_pms_monitor_5;
    volatile sensitive_core_0_pif_pms_monitor_6_reg_t core_0_pif_pms_monitor_6;
    volatile sensitive_backup_bus_pms_constrain_0_reg_t backup_bus_pms_constrain_0;
    volatile sensitive_backup_bus_pms_constrain_1_reg_t backup_bus_pms_constrain_1;
    volatile sensitive_backup_bus_pms_constrain_2_reg_t backup_bus_pms_constrain_2;
    volatile sensitive_backup_bus_pms_constrain_3_reg_t backup_bus_pms_constrain_3;
    volatile sensitive_backup_bus_pms_constrain_4_reg_t backup_bus_pms_constrain_4;
    volatile sensitive_backup_bus_pms_constrain_5_reg_t backup_bus_pms_constrain_5;
    volatile sensitive_backup_bus_pms_monitor_0_reg_t backup_bus_pms_monitor_0;
    volatile sensitive_backup_bus_pms_monitor_1_reg_t backup_bus_pms_monitor_1;
    volatile sensitive_backup_bus_pms_monitor_2_reg_t backup_bus_pms_monitor_2;
    volatile sensitive_backup_bus_pms_monitor_3_reg_t backup_bus_pms_monitor_3;
    volatile sensitive_clock_gate_reg_t clock_gate;
    uint32_t reserved_198[921];
    volatile sensitive_sensitive_reg_date_reg_t sensitive_reg_date;
} sensitive_dev_t;

extern sensitive_dev_t SENSITIVE;

#ifndef __cplusplus
_Static_assert(sizeof(sensitive_dev_t) == 0x1000, "Invalid size of sensitive_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
